results/2021_06_23/scenario_3/hey/TCP/raw

[mick@colossus-guardian CG]$ ./rr
===========================================
1 sender TEST 1
===========================================

Summary:
  Total:	60.0004 secs
  Slowest:	0.0042 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2547.2842
  
  Total data:	1295149212 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [152667]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [131]	|
  0.001 [36]	|
  0.002 [1]	|
  0.002 [1]	|
  0.003 [0]	|
  0.003 [0]	|
  0.003 [0]	|
  0.004 [0]	|
  0.004 [1]	|


Latency distribution:
  10% in 0.0004 secs
  25% in 0.0004 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0004 secs
  99% in 0.0005 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0042 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.0003 secs, 0.0003 secs, 0.0034 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [200]	152838 responses



===========================================
1 sender TEST 2
===========================================

Summary:
  Total:	60.0009 secs
  Slowest:	0.0027 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2517.6772
  
  Total data:	1280107862 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [150837]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [60]	|
  0.001 [60]	|
  0.001 [101]	|
  0.002 [1]	|
  0.002 [1]	|
  0.002 [0]	|
  0.002 [0]	|
  0.002 [1]	|
  0.003 [1]	|


Latency distribution:
  10% in 0.0004 secs
  25% in 0.0004 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0005 secs
  99% in 0.0005 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0027 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.0003 secs, 0.0002 secs, 0.0026 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	151063 responses



===========================================
1 sender TEST 3
===========================================

Summary:
  Total:	60.0008 secs
  Slowest:	0.0023 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2554.6325
  
  Total data:	1298894720 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.000 [152878]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [228]	|
  0.001 [12]	|
  0.001 [136]	|
  0.001 [23]	|
  0.001 [0]	|
  0.002 [1]	|
  0.002 [0]	|
  0.002 [0]	|
  0.002 [1]	|


Latency distribution:
  10% in 0.0004 secs
  25% in 0.0004 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0004 secs
  99% in 0.0005 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0023 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.0003 secs, 0.0003 secs, 0.0017 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [200]	153280 responses



===========================================
1 sender TEST 4
===========================================

Summary:
  Total:	60.0003 secs
  Slowest:	0.0029 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2499.8716
  
  Total data:	1271040682 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [149792]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [38]	|
  0.001 [112]	|
  0.001 [47]	|
  0.002 [0]	|
  0.002 [1]	|
  0.002 [0]	|
  0.002 [0]	|
  0.003 [1]	|
  0.003 [1]	|


Latency distribution:
  10% in 0.0004 secs
  25% in 0.0004 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0005 secs
  99% in 0.0005 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0029 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.0003 secs, 0.0003 secs, 0.0028 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [200]	149993 responses



===========================================
1 sender TEST 5
===========================================

Summary:
  Total:	60.0003 secs
  Slowest:	0.0020 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2480.6858
  
  Total data:	1261287108 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.000 [142693]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [5977]	|■■
  0.001 [9]	|
  0.001 [16]	|
  0.001 [130]	|
  0.001 [14]	|
  0.001 [1]	|
  0.002 [0]	|
  0.002 [0]	|
  0.002 [1]	|


Latency distribution:
  10% in 0.0004 secs
  25% in 0.0004 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0005 secs
  99% in 0.0005 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0020 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.0003 secs, 0.0002 secs, 0.0015 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0011 secs

Status code distribution:
  [200]	148842 responses



===========================================
10 senders TEST 1
===========================================

Summary:
  Total:	60.0008 secs
  Slowest:	0.0369 secs
  Fastest:	0.0004 secs
  Average:	0.0006 secs
  Requests/sec:	16127.0412
  
  Total data:	8199738990 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [967549]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [65]	|
  0.011 [0]	|
  0.015 [0]	|
  0.019 [0]	|
  0.022 [1]	|
  0.026 [9]	|
  0.030 [0]	|
  0.033 [0]	|
  0.037 [10]	|


Latency distribution:
  10% in 0.0005 secs
  25% in 0.0006 secs
  50% in 0.0006 secs
  75% in 0.0007 secs
  90% in 0.0007 secs
  95% in 0.0007 secs
  99% in 0.0008 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0369 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0015 secs
  resp wait:	0.0006 secs, 0.0003 secs, 0.0368 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0048 secs

Status code distribution:
  [200]	967635 responses



===========================================
10 senders TEST 2
===========================================

Summary:
  Total:	60.0012 secs
  Slowest:	0.0049 secs
  Fastest:	0.0004 secs
  Average:	0.0006 secs
  Requests/sec:	15927.4631
  
  Total data:	8098322158 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [951580]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [3308]	|
  0.002 [690]	|
  0.002 [67]	|
  0.003 [2]	|
  0.003 [0]	|
  0.004 [3]	|
  0.004 [6]	|
  0.004 [0]	|
  0.005 [10]	|


Latency distribution:
  10% in 0.0005 secs
  25% in 0.0006 secs
  50% in 0.0006 secs
  75% in 0.0007 secs
  90% in 0.0007 secs
  95% in 0.0007 secs
  99% in 0.0008 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0049 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0028 secs
  resp wait:	0.0006 secs, 0.0003 secs, 0.0038 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0033 secs

Status code distribution:
  [200]	955667 responses



===========================================
10 senders TEST 3
===========================================

Summary:
  Total:	60.0014 secs
  Slowest:	0.0033 secs
  Fastest:	0.0004 secs
  Average:	0.0006 secs
  Requests/sec:	16128.3186
  
  Total data:	8200467754 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [841879]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [124109]	|■■■■■■
  0.001 [954]	|
  0.002 [585]	|
  0.002 [149]	|
  0.002 [9]	|
  0.002 [9]	|
  0.003 [7]	|
  0.003 [13]	|
  0.003 [6]	|


Latency distribution:
  10% in 0.0005 secs
  25% in 0.0006 secs
  50% in 0.0006 secs
  75% in 0.0007 secs
  90% in 0.0007 secs
  95% in 0.0007 secs
  99% in 0.0008 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0033 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0006 secs, 0.0003 secs, 0.0033 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0024 secs

Status code distribution:
  [200]	967721 responses



===========================================
10 senders TEST 4
===========================================

Summary:
  Total:	60.0008 secs
  Slowest:	0.0043 secs
  Fastest:	0.0004 secs
  Average:	0.0006 secs
  Requests/sec:	16150.9599
  
  Total data:	8211907654 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [959913]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [8189]	|
  0.002 [806]	|
  0.002 [129]	|
  0.002 [7]	|
  0.003 [3]	|
  0.003 [12]	|
  0.004 [7]	|
  0.004 [1]	|
  0.004 [3]	|


Latency distribution:
  10% in 0.0005 secs
  25% in 0.0006 secs
  50% in 0.0006 secs
  75% in 0.0007 secs
  90% in 0.0007 secs
  95% in 0.0007 secs
  99% in 0.0008 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0043 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.0006 secs, 0.0003 secs, 0.0030 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0037 secs

Status code distribution:
  [200]	969071 responses



===========================================
10 senders TEST 5
===========================================

Summary:
  Total:	60.0012 secs
  Slowest:	0.0043 secs
  Fastest:	0.0004 secs
  Average:	0.0006 secs
  Requests/sec:	16013.0341
  
  Total data:	8141836148 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [948420]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [11336]	|
  0.002 [833]	|
  0.002 [169]	|
  0.002 [16]	|
  0.003 [6]	|
  0.003 [3]	|
  0.004 [8]	|
  0.004 [5]	|
  0.004 [5]	|


Latency distribution:
  10% in 0.0005 secs
  25% in 0.0006 secs
  50% in 0.0006 secs
  75% in 0.0007 secs
  90% in 0.0007 secs
  95% in 0.0007 secs
  99% in 0.0008 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0043 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0010 secs
  resp wait:	0.0006 secs, 0.0003 secs, 0.0036 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0024 secs

Status code distribution:
  [200]	960802 responses



[mick@colossus-guardian CG]$